## Plan Result (ithc_pubsubappgateway - TerraformPlanApply)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.pubsubappgateway[0].azurerm_application_gateway.ag[0]
  * module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.pubsubappgateway[0].azurerm_web_application_firewall_policy.waf_policy[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pubsubappgateway[0].azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw"
        name                              = "cft-pubsub00-ithc-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/backendHttpSettingsCollection/webpubsub-http" -> null
          - name                                = "webpubsub-http" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/probes/pubsub-http" -> null
          - probe_name                          = "pubsub-http" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 20 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "em-icp-webpubsub-ithc.webpubsub.azure.com" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/backendHttpSettingsCollection/em-icp-webpubsub-https" -> null
          - name                                = "em-icp-webpubsub-https" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 443 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/probes/em-icp-webpubsub-https" -> null
          - probe_name                          = "em-icp-webpubsub-https" -> null
          - protocol                            = "Https" -> null
          - request_timeout                     = 20 -> null
          - trusted_root_certificate_names      = [] -> null
            # (2 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "em-icp-webpubsub-ithc.webpubsub.azure.com"
          + id                                  = (known after apply)
          + name                                = "em-icp-webpubsub"
          + pick_host_name_from_backend_address = false
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "em-icp-webpubsub"
          + protocol                            = "Https"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (2 unchanged attributes hidden)
        }

      - frontend_port {
          - id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/frontendPorts/port_443" -> null
          - name = "port_443" -> null
          - port = 443 -> null
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/frontendPorts/port_443" -> null
          - frontend_port_name             = "port_443" -> null
          - host_name                      = "em-icp-webpubsub.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/httpListeners/https-ithc-pubsub" -> null
          - name                           = "https-ithc-pubsub" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = true -> null
          - ssl_certificate_id             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/sslCertificates/wildcard-ithc-platform-hmcts-net" -> null
          - ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net" -> null
            # (3 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "em-icp-webpubsub.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/httpListeners/em-icp-webpubsub" -> null
          - name                           = "em-icp-webpubsub" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Https"
          + host_name                      = "em-icp-webpubsub.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "em-icp-webpubsub"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }

      - identity {
          - identity_ids = [
              - "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-pubsub00-ithc-agw",
            ] -> null
          - type         = "UserAssigned" -> null
            # (2 unchanged attributes hidden)
        }

      - probe {
          - host                                      = "em-icp-webpubsub-ithc.webpubsub.azure.com" -> null
          - id                                        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/probes/em-icp-webpubsub-https" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "em-icp-webpubsub-https" -> null
          - path                                      = "/api/health" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Https" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "em-icp-webpubsub-ithc.webpubsub.azure.com" -> null
          - id                                        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/probes/pubsub-http" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "pubsub-http" -> null
          - path                                      = "/api/health" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + host                                      = "em-icp-webpubsub-ithc.webpubsub.azure.com"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "em-icp-webpubsub"
          + path                                      = "/api/health"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/backendAddressPools/em-icp-webpubsub" -> null
          - backend_address_pool_name   = "em-icp-webpubsub" -> null
          - backend_http_settings_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/backendHttpSettingsCollection/em-icp-webpubsub-https" -> null
          - backend_http_settings_name  = "em-icp-webpubsub-https" -> null
          - http_listener_id            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/httpListeners/em-icp-webpubsub" -> null
          - http_listener_name          = "em-icp-webpubsub" -> null
          - id                          = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/requestRoutingRules/pubsub-http" -> null
          - name                        = "pubsub-http" -> null
          - priority                    = 9 -> null
          - rule_type                   = "Basic" -> null
            # (6 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/backendAddressPools/em-icp-webpubsub" -> null
          - backend_address_pool_name   = "em-icp-webpubsub" -> null
          - backend_http_settings_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/backendHttpSettingsCollection/em-icp-webpubsub-https" -> null
          - backend_http_settings_name  = "em-icp-webpubsub-https" -> null
          - http_listener_id            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/httpListeners/https-ithc-pubsub" -> null
          - http_listener_name          = "https-ithc-pubsub" -> null
          - id                          = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw/requestRoutingRules/em-icp-webpubsub-https" -> null
          - name                        = "em-icp-webpubsub-https" -> null
          - priority                    = 10 -> null
          - rule_type                   = "Basic" -> null
            # (6 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "em-icp-webpubsub"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "em-icp-webpubsub"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "em-icp-webpubsub"
          + id                          = (known after apply)
          + name                        = "em-icp-webpubsub"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (9 unchanged blocks hidden)
    }

  # module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-pubsub00-ithc-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.pubsubappgateway[0].azurerm_web_application_firewall_policy.waf_policy[0] will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "waf_policy" {
        id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/cft-pubsub-waf-policy-ithc"
        name                = "cft-pubsub-waf-policy-ithc"
        tags                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
            "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ enabled                          = false -> true
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label ithc_pubsubappgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/2407/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":2407,"Program":"tfcmt","SHA1":"","Target":"ithc_pubsubappgateway - TerraformPlanApply","Vars":{}} -->